Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: ཆོས་འདོད་པའི་འཁོར་འདི་འདྲ་བ་རྙེད་དཀའ་བ་དང་། དགེ་བའི་གྲོགས་པོ་ལ་དམིགས་པའི་གཙུག་ལག་འདི་འདྲ་བ་རྙེད་དཀའ་བ་དང་།
en: It is difficult to find an assembly like this that is intent upon the Dharma, it is difficult to find a place of retreat like this where one can observe virtuous companions, and it is difficult to find beings like this who listen to and focus on the Dharma.

source: ཆོས་མཉན་པ་ལ་དམིགས་པ་འདི་འདྲ་བ་རྙེད་དཀའ་བ་ཁྱོད་ཀྱིས་ཐོབ་པ་ཇི་ལྟར་སྔོན་མ་ཐོས་པ་ད་ཉོན་ཅིག །
en: Now that you have obtained those circumstances, listen to this Dharma teaching that has never been heard before!

source: སུས་ཡོངས་སུ་མ་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་འགྱུར་རོ། །ལམ་སྔོན་ཁོང་དུ་མ་ཆུད་པ་ཁོང་དུ་ཆུད་པར་གྱུར་ཅིག །
en: May those who lack understanding gain understanding and comprehend the path that they did not comprehend before.

source: ཁྱོད་སྔོན་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་མངོན་སུམ་དུ་མ་ཡིན་པ་དེ་ད་མངོན་སུམ་དུ་བྱུང་བར་གྱུར་ཅིག །
en: May the aggregates, elements, and sense fields that were not apparent to you before become apparent.

source: ཁྱོད་སྔོན་འཕགས་པའི་ལམ་གྱི་ཡན་ལག་བརྒྱད་མ་བསྒོམས་པ་དེ་ད་སེམས་བསྒོམས་པར་གྱུར་ཅིག །
en: May those of you who have not cultivated the noble eightfold path before cultivate that intention now.

source: ཁྱོད་ཟག་པ་མ་ཟད་པ་ཟད་པར་འགྱུར་བ་དང་མུན་པ་མུན་ནག་ཏུ་གྱུར་པའི་འཁོར་བ་རྣམས་ཤེས་རབ་ཆེན་པོའི་སྣང་བ་དང་ལྡན་པར་གྱུར་ཅིག །
en: May you eliminate the defilements that are not yet eliminated and be endowed with the light of great insight that illuminates those who circle in the dense obscurity of darkness!

source: དེ་ནས་ཁྱོད་དེ་མ་ཐག་ཏུ་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་དང་། ཚངས་པར་སྤྱོད་པ་ཐམས་ཅད་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་དེ་བཞིན་དུ་ཉོན་ཅིག །
en: Listen at once to the fully ripened result of all your austerities, observances, and religious conduct.

source: ཇི་ལྟར་བཅོམ་ལྡན་འདས་དྲང་སྲོང་ཆེན་པོ་ད་ལྟར་སེམས་རྩེ་གཅིག་ཏུ་སྟོན་ཏོ། །
en: The blessed great sage will now teach to you one-pointedly!”

source: དེ་ནས་མུ་སྟེགས་ཅན་དེ་དག་ཐམས་ཅད་མགུ་ཞིང་རངས་པ་དང་། རབ་ཏུ་དགའ་བའི་སེམས་ཀྱིས་སེམས་རྩེ་གཅིག་ཏུ་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པར་ལྟ་བར་གྱུར་ཏོ། །
en: Pleased, delighted, and thrilled, all those non-Buddhists joined their palms with one-pointed attention and gazed at the Blessed One without blinking.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དྲི་མ་མེད་པའི་གོས་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། །རིགས་ཀྱི་བུ་ཅི་འདྲ་བའི་ཚུལ་གྱིས་ན་བཟོད་པ་སོ་སོར་ཐོབ།
en: The Blessed One then asked Immaculately Clothed Youth, “Noble son, how will each of these beings obtain acceptance?

source: དམ་པའི་ཆོས་ཅི་འདྲ་བའི་ཚུལ་གང་དང་གང་གིས་ན་སེམས་ཅན་སྙིང་པོར་གནས་པ་ལ་གྲོལ་བར་འགྱུར་རམ།
en: What sacred Dharma will lead these beings to liberation at the seat of awakening?

source: ཚུལ་ཐམས་ཅད་ཟད་པའི་ཕ་རོལ་ཏུ་འགྲོ་བར་འགྱུར་རམ།
en: Can any method lead them to the other shore of extinction?

source: ཅི་རལ་པས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རམ།
en: Does matted hair cause beings to be liberated?

source: འོན་ཏེ་རུས་པས་སམ། ལུད་ཀྱིས་བྱུག་པ་དང་། ཐལ་བའི་མལ་གྱིས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རམ།
en: Do bones, smearing with dung, or making one’s bed in ashes lead to complete liberation?

source: འོན་ཏེ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། ཟླ་བ་དང་། ཉི་མ་དང་། མེ་དང་སྟེན་པའི་བར་དུ་སྙིང་པོར་གནས་པ་ལ་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རམ།
en: Do the practices that rely on Śakra, Brahmā, the Moon, the Sun, or Agni lead to liberation at the seat of awakening?

source: འཇིགས་པ་རྣམ་པ་ཐམས་ཅད་ཟད་པའི་ཕ་རོལ་ཏུ་འགྲོ་བར་འགྱུར་རམ། དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Can any type of fear lead them to the other shore of extinction?”

source: དྲི་མ་མེད་པའི་གོས་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སེམས་ཅན་ལྟ་བའི་རྙེད་པ་འདིས་སྙིང་པོར་གནས་པ་ལ་འགྲོ་བར་མི་འགྱུར་རོ། །
en: Youthful Immaculately Clothed Youth replied, “Respected Blessed One, beings who adhere to wrong views will not reach the seat of awakening.

source: འཆི་འཕོ་དང་སྐྱེ་བ་ཤིན་ཏུ་སྲིད་པ་འགྲོ་བ་ལ་བརྟག་པ་ན་སྲིད་པ་ཀུན་ཏུ་སྦྱོར་བའི་ཕ་རོལ་ཏུ་འགྲོ་བར་མི་འགྱུར་རོ། །
en: When they analyze the process of death, birth, and existence they will not overcome the fetters of existence.

source: སེམས་ཅན་གྱི་མཐའ་འདི་གཉིས་ཀྱིས་གང་སོ་སོར་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའ་ལ་འགྲོ་བའི་འོད་ཀྱིས་འདུལ་བའི་བཟོད་པ་འདི་ཡོངས་སུ་ཉམས་པར་འགྱུར་རོ། །
en: Due to the two extremes, those beings will completely corrupt this acceptance of taming beings with the perfect method of conduct and light rays that travel through space.

source: གང་ཡང་འདོད་པ་དང་འདོད་པ་བདེ་བའི་རྗེས་སུ་སྦྱོར་བ་རང་བཞིན་གྱིས་འགྲོ་བ་ངན་པའི་མི་ལ་བརྩོན་ནོ། །གང་ཡང་བདག་ལ་གནོད་པར་སྦྱོར་བའི་ཞགས་པ་འཐུབ་པ་དགུ་བཅུ་རྩ་ལྔ་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་ངན་པ་འཕགས་པ་མ་ཡིན་པ་དང་། དོན་དུ་མི་འགྱུར་བ་འདི་གཉིས་ཀྱི་བཟོད་པ་ཡོངས་སུ་ཉམས་པའི་ཕྱིར་འཇིག་པར་འགྱུར་རོ། །
en: Those who strive for a lowly human birth because their nature is to pursue their desires and pleasures, and those who inflict harm upon themselves through the pointless, ignoble, and inferior practices and observances of the ninety-five nirgranthas, these two types of people are led to ruin because they lack acceptance.

source: ཉོན་མོངས་པའི་ཕུང་པོ་ཆེན་པོ་འབྱུང་བར་འགྱུར་རོ། །
en: They give rise to a great mass of afflictions.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་འདི་བཟོད་པ་སྒོམ་པ་དག །གང་གིས་བཟོད་པ་ཐོབ་བ་མི་ཤེས་སོ། །
en: Respected Blessed One, such people who cultivate this acceptance do not know how to attain acceptance.

source: གང་ལ་འདོད་ཆགས་ཞེ་སྡང་དང་། ང་རྒྱལ་འཆབ་པ་རབ་ཏུ་གནས། །ཕུང་པོ་ལྔ་དང་མི་ལྡན་པས། །བྱས་པ་ཤེས་ལ་མེད་པར་འགྲོལ། །
en: “When one harbors attachment, Anger, pride, and jealousy, And thinks and acts as if one does not Consist of the five aggregates, one will not be liberated.

source: ཕ་མ་དགྲ་བཅོམ་སྟོང་པ་སྟེ། །སྟོང་པའི་ཆོས་ལ་བསྟེན་པས་ན། །དངོས་པོ་མེད་ཅིང་འདྲེས་མེད་པ། །ཚུལ་གཅིག་གིས་ནི་གྲོལ་བར་འགྱུར། །
en: “They will be liberated who rely upon the fact that One’s parents and the worthy ones are empty, And phenomena are empty, because they are Insubstantial, unadulterated, and a likeness.

source: ཚོར་བ་རྣམ་གསུམ་འདྲེས་མེད་ཅིང་། །འདུ་བྱེད་གསུམ་ཡང་སྙེམས་པ་མེད། །ཇི་ལྟར་ཤེས་པ་མཆོག་གི་ཕྱིར། །སྲིད་པ་ཟད་ལ་འགྲོལ་བར་འགྱུར།
en: “Those who are not tainted by the three types of feelings, And are not arrogant regarding the three types of formations, Exhaust existence and attain liberation Through their supreme knowledge.

source: ཁམས་གསུམ་དག་ནི་སྙེམས་མེད་པ། །རིག་པ་གསུམ་ནི་རབ་ཏུ་བསླབས། །ཚོར་བ་རྣམ་གསུམ་ཡོངས་ཤེས་ཤིང་། །དུས་གསུམ་ལ་ནི་ཆགས་པ་མེད། །
en: “They have no conceit related to the three realms, They have thoroughly trained in the three types of knowledge, They understand the three types of feelings, And they are not attached to the three times.

source: སྨོན་པའི་འདོད་ཆགས་ཟད་པ་དང་། །བརྗོད་དུ་མེད་ལ་གྲོལ་བར་འགྱུར། །
en: “Their desires are extinguished, And they will attain inexpressible liberation.

source: ཇི་ལྟར་ཉི་ཟླ་ནམ་མཁའ་རྣམས། །རྒྱུ་བ་ལ་ནི་ཆགས་པ་མེད། །མཐའ་གཉིས་རྣམ་པར་སྤངས་ནས་ནི། །སྐྱེ་བ་ཟད་ལ་འགྲོལ་བར་འགྱུར། །
en: Just as the sun and the moon Move within space without attachment, “Those who completely abandon the two extremes Will attain liberation that is the extinction of birth.

source: སྙིང་རྗེ་ཆེན་པོ་རྣམ་གཉིས་སྤོང་། །སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་བཀྲོལ། །
en: The great compassionate ones who abandon the two extremes Will become free from all suffering.

source: བློ་གྲོས་རྟོག་པ་སྤངས་པས་ན། །སྙིང་པོར་གནས་པ་རྣམ་པར་བཀྲོལ། །
en: “Those who have abandoned intellect and concepts Will attain liberation at the seat of awakening.

source: རྟོག་དང་རྣམ་རྟོག་སྤངས་པ་ནི། །བསོད་ནམས་ཆགས་པའི་སྡིག་པ་མེད། །
en: Those who have abandoned thoughts and concepts Are free from misdeeds related to attachment to merit.

source: སེམས་ཅན་རྣམས་ནི་སྙིང་བརྩེའི་ཕྱིར། །སྤྱོད་ལ་ཆགས་པ་འགྲོལ་བར་འགྱུར། །ལྷ་དང་དྲི་ཟ་མི་རྣམས་ཀྱིས། །དྲང་པོའི་ལམ་ནི་མི་ཤེས་སོ། །
en: “They act out of loving compassion And liberate all beings from attachment: Gods, gandharvas, and humans Who do not know the right path.

source: དེ་ལྟར་ཤིན་ཏུ་རྟོགས་པའི་ཕྱིར། །སྤྱོད་ལ་ཆགས་པ་འགྲོལ་བར་འགྱུར། །
en: “They conduct themselves according to Their realization and liberate them from attachment.

source: སྙིང་རྗེ་དང་ལྡན་ཡིད་གཞུངས་པ། །སེམས་ཅན་སྤྱོད་པ་རབ་མི་ཤེས། །
en: One cannot fathom the conduct Of those compassionate and wise beings.

source: ཡེ་ཤེས་མཆོག་དང་ལྡན་པས་ན། །སེམས་ཅན་སངས་རྒྱས་རབ་ཏུ་འགྲོལ། །
en: “Since they are endowed with supreme wisdom, They will liberate beings into the state of buddhahood.”

source: ཡང་དྲི་མ་མེད་པའི་གོས་གཞོན་ནུར་གྱུར་པས་འདི་བསྟན་པའི་ཚེ་ཡོངས་སུ་སྦྱང་བ་སྔོན་བྱས་པའི་མུ་སྟེགས་ཅན་གཞན་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་ཀྱིས་སོ་སོར་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའ་ལ་འགྲོ་བའི་འོད་ཀྱིས་འདུལ་བའི་བཟོད་པ་འདི་སོ་སོར་ཐོབ་པར་གྱུར་ཏོ། །
en: When Immaculately Clothed Youth delivered this teaching, 9,800,000,000 non-Buddhists who had purified themselves in the past achieved the acceptance of taming beings with the perfect method of conduct and light rays that travel through space.

source: མུ་སྟེགས་ཅན་གཞན་མེ་བཅུ་རྡུལ་ཡལ་སྟོང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་པར་གྱུར་ཏོ། །
en: One thousand myriads of other non-Buddhists gave rise to the mind set on unsurpassed and perfect awakening and reached the level of nonregression.

source: ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་གྱུར་ནས་ལྷ་དང་། དྲི་ཟ་དང་། མིའི་འཁོར་ཐམས་ཅད་དང་ལྡན་པ་དེས་དྲི་མ་མེད་པའི་གོས་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ། །སྐྱེས་བུ་དམ་པས་ཤིན་ཏུ་ལེགས་པར་བཤད་པ་ལེགས་སོ་ལེགས་སོ། །
en: The entire assembly of gods, gandharvas, and humans applauded Immaculately Clothed Youth and exclaimed, “Holy being, your explanations are excellent, excellent!”

source: བཅོམ་ལྡན་འདས་དེས་ཀྱང་དྲི་མ་མེད་པའི་གོས་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ། །སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་སེམས་ཅན་མང་པོ་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དང་ལེགས་པར་བཤད་པ་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One also gave his approval to Immaculately Clothed Youth, saying, “Holy being, you have ripened many beings and explained this perfectly!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྒྲ་ཀུན་ཏུ་འཚོ་བའི་མེའི་བརྟུལ་ཞུགས་ཅན་ལ་བཀའ་སྩལ་པ། སྒྲ་ཀུན་ཏུ་འཚོ་བ་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པ་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ནི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡིད་ཀྱིས་བྱ་བ་ལ་ཆགས་པ་མེད་པའོ། །
en: The Blessed One then said to the observant ājīvikas who maintain the fire observance, “Observant ājīvikas, the absence of attachment to mental activity related to the ripening of actions is known as completely purifying karmic hindrances.

source: ཆོས་ཐམས་ཅད་ལ་སྙེམས་པ་མེད་པའོ། །
en: All phenomena are without conceit.

source: འདོད་ཆགས་ཀྱི་མཐའ་ལ་སོགས་པ་མེད་པའོ། །
en: The end of attachment lacks accumulation.

source: ཞེ་སྡང་དང་། གཏི་མུག་གི་མཐའ་ལ་སོགས་པ་མེད་པའོ། །སྙེམས་པ་མེད་པའོ། །ཉེ་བར་འགྲོ་བ་མེད་པའོ། །ཉེ་བར་ལེན་པ་མེད་པའོ། །
en: The end of anger and ignorance also lacks accumulation, conceit, approaching, and grasping.

source: དེ་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་མི་བྱེད་པའོ། །
en: Ultimate reality is not made manifest.

source: གང་མངོན་སུམ་དུ་མི་བྱེད་པ་དེ་རློམ་ཞིང་སེམས་པ་མེད་པའོ། །
en: Whatever is not made manifest is without thoughts and volition.

source: གང་རློམ་ཞིང་སེམས་པ་མེད་པ་དེ་གཟུང་བ་མེད་པའོ། །
en: Whatever lacks thoughts and volition lacks apprehension.

source: གང་གཟུང་བ་མེད་པ་དེ་ཆགས་པ་མེད་པའོ། །
en: Whatever lacks apprehension lacks attachment.

source: གང་ཆགས་པ་མེད་པ་དེ་དངོས་པོ་མེད་པའོ། །
en: Whatever lacks attachment is insubstantial.

source: གང་དངོས་པོ་མེད་པ་དེ་ཤེས་པ་མེད་པའོ། །
en: Whatever is insubstantial lacks knowledge.

source: གང་ཤེས་པ་མེད་པ་དེ་ཚུ་རོལ་དང་ཕ་རོལ་དུའོ། །
en: Whatever lacks knowledge tends toward this side or that side.

source: གང་ཚུ་རོལ་དང་ཕ་རོལ་པོ་དེ་བརྗོད་དུ་མེད་པའོ། །
en: Whatever tends toward this side or that side is inexpressible.

source: གང་བརྗོད་དུ་མེད་པ་དེ་དངོས་པོ་མེད་པའོ། །
en: Whatever is inexpressible is immaterial.

source: གང་དངོས་པོ་མེད་པ་དེ་འབྱུང་བ་མེད་པའོ། །
en: Whatever is immaterial does not arise.

source: གང་འབྱུང་བ་མེད་པ་དེ་འགོག་པ་མེད་པའོ། །
en: Whatever does not arise does not cease.

source: གང་འགོག་པ་མེད་པ་དེ་ཡི་གེ་མེད་པའོ། །
en: Whatever does not cease is wordless.

source: གང་ཡི་གེ་མེད་པ་དེ་དུས་གསུམ་དང་སྐད་ཅིག་མར་བྲལ་བའོ། །
en: Whatever is wordless is free from the three times and from momentariness.

source: གང་དུས་གསུམ་དང་སྐད་ཅིག་མར་བྲལ་བ་དེ་སོ་སོར་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའ་ལ་འགྲོ་བའི་འོད་ཀྱིས་འདུལ་བའི་བཟོད་པ་དང་ལྡན་པའི་གང་བྱང་ཆུབ་སེམས་དཔས་བདུད་ཐམས་ཅད་ཀྱི་ལམ་ལ་ཡོངས་སུ་སྦྱོར་བར་བྱེད་དོ། །
en: Whatever is free from the three times and from momentariness causes bodhisattvas endowed with the acceptance that tames beings with the method of perfect conduct and light rays that travel through space to purify the path of all of the māras.

source: གཞན་ཡང་སྒྲ་ཀུན་ཏུ་འཚོ་བ་གང་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་རེག་པར་མི་བྱེད།
en: Furthermore, observant ājīvikas, those bodhisattvas do not come into contact with the vehicles of the hearers or the solitary buddhas.

source: འདུས་བྱས་ཀྱི་ཆོས་ལ་སྙེམས་པ་མེད་ཅིང་རེག་པར་མི་བྱེད། འདི་ལྟ་སྟེ།
en: They are not arrogant about conditioned phenomena, and they do not come into contact with them.

source: དཔེར་ན་ནམ་མཁའ་དང་ཆོས་ཐམས་ཅད་ལ་སྙེམས་པ་མེད་ཅིང་རེག་པ་མེད་པ་དེ་ལྟར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ལ་སྙེམས་པ་མེད་ཅིང་རེག་པ་མེད་དེ། དེ་ནས་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་སྦྱོང་བར་བྱེད་དོ། །
en: Analogously, just as space and all phenomena have no conceit and lack contact, in the same way there is no conceit and no contact with respect to the qualities of the bodhisattvas, and so they completely purify karmic hindrances.”

source: འདི་སྟོན་པ་བསྟན་པའི་ཚེ་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ཀྱི་ལས་སྔོན་བྱས་པའི་མུ་སྟེགས་ཅན་གཞན་སོ་སོར་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའ་ལ་འགྲོ་བའི་འོད་ཀྱིས་འདུལ་བའི་བཟོད་པ་ཞེས་བྱ་བ་སོ་སོར་ཐོབ་པར་གྱུར་ཏོ། །
en: As this teaching was being delivered, non-Buddhists as numerous as all the grains of sand in the Ganges who had performed deeds in their past lives each attained this acceptance of taming beings with the method of perfect conduct and light that travels through space.

source: ཆུ་བོ་གང་གཱ་བདུན་གྱི་བྱེ་མ་སྙེད་ཀྱི་མུ་སྟེགས་ཅན་གཞན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་པར་གྱུར་ཏོ། །ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་གྱུར་ཏོ། །
en: Other non-Buddhists as numerous as all the grains of sand in seven Ganges Rivers gave rise to the mind set on unsurpassed and perfect awakening and reached the level of nonregression.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བདུད་སྤོང་བ་ཀུན་ཏུ་རྒྱུ་ལ་བཀའ་སྩལ་པ། བདུད་སྤོང་བ་གང་ཁྱིམ་གྱི་གནས་ནས་བྱུང་སྟེ་ཐར་པ་ལ་མངོན་པར་བརྩོན་པའི་རྐྱེན་གྱིས་ཆོས་དང་ཆོས་ཉིད་ཀྱི་རྗེས་སུ་རབ་ཏུ་མི་ཤེས་སོ། །ཡོངས་སུ་གྲོལ་བ་མེད་དོ། །སྐྱེ་བ་དང་། རྒ་ཤི་དང་།
en: The Blessed One then said to the parivrājakas who renounce Māra, “Renouncers of Māra who renounce their households and strive for liberation will not, through those circumstances, completely understand phenomena and their true nature, and they will not be liberated.

source: མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ཡོངས་སུ་ཐར་པ་མེད་དོ། །
en: They will not be liberated from birth, old age and death, misery, lamentation, suffering, unhappiness, and distress.

source: ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་རྟག་ཏུ་ཕྱི་མའི་མཐའ་འཁོར་བའི་ཆུ་ཀླུང་རྟག་ཏུ་འབབ་བོ། །
en: In the future, they will always be endowed with the aggregates, the elements, and the sense fields, and the rivers of saṃsāra will flow continuously.

source: ཅི་འདྲ་བའི་ཡིད་མ་བགྱིས་ན་རྐྱེན་གྱིས་རབ་ཏུ་མི་ཤེས། འདི་ལྟ་སྟེ།
en: Without the appropriate mindset, they will not gain understanding through those circumstances.

source: དེ་བཞིན་དུ་ཁྱོད་ཀྱི་གཟུགས་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་དང་། ཚངས་པར་སྤྱོད་པའི་འབྲས་བུ་མེད་པ། འཕགས་པ་ལ་དམོད་པ་ནི་ཇི་ལྟར་ལ་ལ་གོས་མེད་པ་དང་། ལ་ལ་གོས་བོར་བ་དང་།
en: “Your physical austerities, observances, and practice of the religious life are fruitless and they are condemned by the noble ones.

source: ལ་ལ་རུས་པའི་རྡུལ་གྱིས་བྱུགས་པ་དང་། ལ་ལ་ཐལ་བས་བྱུགས་པ་དང་། ལ་ལ་སྣག་ཚས་བྱུགས་པ་དང་། ལ་ལ་ཁུ་ཆུ་བྱུང་བས་བྱུགས་པ་དང་། ལ་ལ་བད་ཀན་གྱིས་བྱུགས་པ་དང་། ལ་ལ་ཉལ་ཉིལ་གྱིས་བྱུགས་པས་འཁོད་དོ། །ལ་ལ་སྐྲའི་སྣམ་བུ་གྱོན་ཏོ། །ལ་ལ་བལ་གྱི་སྣམ་བུ་དང་། ལ་ལ་སྨྱིག་མའི་གོས་དང་།
en: Some among you are naked, some cast off their clothes, some smear their bodies with ashes from bones, some smear their bodies with dust, some smear their bodies with soot, some smear their bodies with saliva, some smear their bodies with phlegm, and some smear their bodies with garbage.

source: ལ་ལ་རྩྭའི་འདབ་མའི་གོས་དང་། ལ་ལ་དུར་ཁྲོད་པའི་གོས་དང་། ལ་ལ་མིང་མཁན་ཙམ་གྱི་གོས་དང་། ལ་ལ་བྱའི་གོས་དང་། ལ་ལ་བ་ལང་གི་སླུད་བུ་དང་། ལ་ལ་ཕྱག་དར་ཁྲོད་ཀྱི་གོས་དང་། ལ་ལ་པགས་པ་དང་། རྙིང་པའི་གོས་གྱོན་ཏོ། །ལ་ལ་ཚོད་མ་ཟ་བར་འགྱུར་རོ། །ལ་ལ་ནས་ཟ་བ་དང་། ནས་ལས་བྱས་པ་ཟ་བ་དང་། སྦུན་པ་ཟ་བ་དང་། བྱ་ཟ་བ་དང་། རི་དགས་ཟ་བ་དང་། དུག་ཟ་བ་དང་། མར་ཟ་བ་དང་། འབྲས་བུ་ཟ་བ་དང་། རྩ་བ་ཟ་བ་དང་། ཤུན་ཕྲགས་ཟ་བ་དང་།
en: Some wear clothes made of hair, some wear woolen clothes, some wear clothes made of bamboo, some wear clothes made of blades of grass, some wear clothes from the charnel grounds, some wear clothes that only convey a name, some dress like a bird, some join a herd of cows, some wear rubbish, some wear hides, and some wear worn-out clothes.

source: འདབ་མ་ཟ་བ་དང་། མེ་ཏོག་ཟ་བ་དང་། ལ་ལ་ཡང་འབྲས་བུའི་རོ་ཟ་བ་དང་། ལ་ལ་ཡང་པད་མོའི་རྩ་བའི་ཚལ་པ་ཟ་བ་དང་། རླུང་ཟ་བ་དང་།
en: Some eat vegetable broth, some eat barley, some eat food derived from barley, some eat grain chaffs, some eat fowl, some eat deer, some eat poison, some eat butter, some eat fruit, some eat roots, some eat bark, some eat leaves, some eat flowers, some feed on fruit juices, some eat pieces of lotus root, some feed on air, some eat skin, some feed on blood, and some spend the entire day eating dried vomit.

source: པགས་པ་ཟ་བ་དང་། ཁྲག་ཟ་བ་དང་། ལ་ལ་ཡང་ངན་སྐྱུགས་སྐམ་པོ་ཟ་བར་འགྱུར་བ་དེ་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད་དོ། །ལ་ལ་དེ་བཞིན་དུ་ས་ཁར་ཟ་བ་ལེན་པ་མེད་ཅིང་ལག་པས་མ་ཡིན།
en: Some do not accept food to eat that has touched the ground or has been touched by someone’s hand or by someone’s mouth.

source: ཁས་མ་ཡིན། ལྷུང་བཟེད་ལས་མ་ཡིན། འབྲེང་བུས་མ་ཡིན། གཏུན་བུའི་བར་ལས་མ་ཡིན། རྩྭ་ལས་མ་ཡིན་ཞིང་ཉིང་རུམ་ལས་ཟ་བ་སོ་སོར་ལེན་པ་མེད་དོ། །
en: Some do not accept food to eat that comes from a begging bowl, from a leather vessel, from a pestle, or food that is made with herbs.

source: རྗེའུ་རིགས་ཀྱི་ལག་པ་ནས་ཟ་བ་སོ་སོར་ལེན་པ་མེད་དོ། །བྲམ་ཟེའི་ལག་པ་ནས་མ་ཡིན། མཐའ་མེད་པའི་ལག་པ་ནས་མ་ཡིན། བྱོལ་སོང་བའི་སྐྱེ་གནས་ཀྱི་ཁ་ནས་མ་ཡིན།
en: Some do not accept food that comes from the hands of a member of the vaiśya caste.

source: ཆུར་བོར་བ་ལས་མ་ཡིན། ས་ལ་བཞག་པ་ལས་མ་ཡིན། རིའི་ཁ་ལས་མ་ཡིན། སྣོད་གཅིག་ཏུ་གཉིས་ཟ་ཟ་བ་མ་ཡིན། བཟའ་བ་ལག་པས་ལེན་པ་མེད་དོ། །
en: Some do not accept food that comes from the hands of brahmins, food that comes from undetermined hands, food that comes from the mouth of animals, food that has been thrown in water, food that has been left on the ground, food that is found on mountain passes, two different types of food that are mixed in a single pot, or food from the hands of someone who is eating.

source: ལ་ལ་གཤེར་བ་ལས་ཟ་བ་མེད་དོ། །གང་ལ་བུད་མེད་སྦྲུམ་པ་མེད་པ་དང་། གང་ན་ཁྱིམ་གནས་པ་མེད་པ་དང་། གང་ན་ཆོ་ག་མེད་པ་དང་། གང་ན་སྦྲང་མ་རྒྱུ་བ་འདི་ལ་ཟ་བ་མེད་དོ། །
en: Some do not eat food made with fat, some do not eat in the presence of pregnant women, some do not eat food inside households, some do not eat food during a ritual, and some do not eat food in places where flies are flying around.

source: བཙུན་པ་ཁྱོད་ཀྱི་ཕྱིར་གང་སུ་ཞིག་གིས་མཆོད་སྟོན་དེ་ལྟར་བྱས་སོ་ཞེས་དེ་བཞིན་སྨྲས་པ་འདི་ཟོས་པ་མེད་དོ། །
en: “Venerable ones, when someone holds a feast in your honor, you acknowledge that they did so, but do not eat those offerings.

source: མར་མེད་པ་དང་། ཤ་མེད་པ་དང་། སྒོག་པ་མེད་པ་ཆེད་ཀར་བྱས་ཏེ་ཟོས་པ་མེད་དོ། །
en: Some do not eat butter, meat, garlic, or food made purposefully.

source: ཆང་འཐུངས་པ་མེད་དོ། །
en: Some do not drink alcohol.

source: སྦྲང་རྩི་དང་། བུ་རམ་དང་། དགུན་ཆང་དང་། མར་འཐུང་ཞིང་ཟས་དང་སྐོམ་གཞན་ལེན་པའང་མེད་དོ། །
en: Some only drink liquors made with honey, molasses, or grapes, as well as butter, and they do not accept any other food or drinks.

source: ཁྱིམ་གཅིག་ཏུ་ཐམས་ཅད་ཟའོ། །
en: Some eat everything in a single household.

source: ལ་ལ་ཡང་རིལ་པོ་གཅིག་གིས་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད།
en: Some eat a single lump of food in a whole day.

source: ལ་ལ་རིལ་པོ་གཉིས་ལས་བདུན་གྱི་བར་དུ་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད། ལ་ལ་ཡང་རིལ་པོ་གཅིག་གིས་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད།
en: Some eat two to seven lumps of food in a whole day.

source: ལ་ལ་ཉིན་མཚན་གསུམ་དང་། ལ་ལ་བཞི་དང་། ལ་ལ་ལྔ་དང་། ལ་ལ་དྲུག་དང་། ལ་ལ་ཡང་ཉིན་མཚན་བདུན་གྱིས་ཤིན་ཏུ་གཏོང་བར་བྱེད།
en: Some eat a single lump of food in a whole day, and others do so in three, four, five, six, or up to seven days and nights.

source: ལ་ལ་ཡང་སློང་བ་གཅིག་གིས་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད། ལ་ལ་གཉིས་དང་གསུམ་ནས་བདུན་གྱི་བར་དུ་སློང་བས་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད། ལ་ལ་ཚེར་མའི་ནང་དུ་མལ་བྱེད་པ་དང་། ལ་ལ་ཞིང་གི་རོལ་དང་།
en: Some beg for food once in a whole day, and some beg two, three, or up to seven times in a whole day.

source: ལ་ལ་རུས་པ་དང་། ལ་ལ་ཐལ་བ་དང་། ལ་ལ་གྲམ་བུ་དང་། ལ་ལ་རྡོ་བ་དང་། ལ་ལ་གཏུན་བུའི་སྡུག་བསྔལ་གྱི་ནང་དུ་མལ་བྱེད་པར་འགྱུར་རོ། །
en: Some undergo suffering by sleeping on beds covered with thorns, in the furrow of a field, on bones, on heaps of dust, on pebbles, on stones, or on pestles.

source: ལ་ལ་སྟན་གྱིས་ཡོངས་སུ་བསྐོར་བ་དང་།
en: Some surround themselves with mats.

source: ལ་ལ་ལག་པ་གྱེན་དུ་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད།
en: Some spend both day and night with one arm raised.

source: ལ་ལ་ལག་པ་ཡན་ལག་ལ་འཇུས་ཤིང་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད།
en: Some spend both day and night with their hand holding a tree branch.

source: ལ་ལ་སྐྲ་དང་། ཨག་ཙོམ་དང་། ལ་ལ་རྐང་པའི་ཡན་ལག་ལ་འཇུས་ཤིང་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད།
en: Some spend both day and night hanging from a branch by their hair, beards, or feet.

source: ལ་ལ་ཆུའི་ནང་དུ་ཞུགས་ཏེ་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད།
en: Some spend both day and night in water.

source: ལ་ལ་རྐང་པ་གཅིག་གིས་ཟླ་བ་བསྟོད་པས་ན་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད།
en: Some spend both day and night praising the moon while standing on one foot.

source: ཉི་མས་སྐེམས་པས་ན་ཉིན་མཚན་ལྔས་ཤིན་ཏུ་གཏོང་བར་བྱེད།
en: Some can spend five full days drying up under the sun.

source: ལ་ལ་སྐྲ་དང་ཨག་ཙོམ་འཐོག་པ་དང་ལྡན་པས་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད།
en: Some spend both day and night plucking out their hair and beards.

source: ལ་ལ་རལ་པ་ཡང་འཛིན་པར་བྱེད། ཆུ་ཡང་འཛིན་པར་བྱེད། དབྱིག་པ་གསུམ་སྤྱོད་པར་བྱེད།
en: Some wear matted hair, carry water, and perform the conduct of the triple restraint.

source: ལ་ལ་རི་ལ་ལྟུང་བར་བྱེད། ལ་ལ་མེ་ལ་ལྟུང་བར་བྱེད། ལ་ལ་ཆུ་ལ་འཇུག་པར་བྱེད།
en: Some throw themselves from mountains, some throw themselves into fire, and some plunge into the water.

source: ལ་ལ་རི་དང་ཤིང་དང་ལྟེང་ཀའི་ལྷ་བྲན་ལ་ཕྱག་བྱ་བས་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད། ལ་ལ་བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་བརྟུལ་ཞུགས་ཀྱིས་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་བྱེད།
en: Some spend both day and night revering divine beings living in mountains, forests, and ponds, and some spend both day and night engaged in the observances of animals.

source: སྡིག་པ་སྤོང་བ་ཁྱོད་ཀྱིས་གཟུགས་དེ་བཞིན་དུ་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་དང་། ཚངས་པར་སྤྱོད་པ་ལ་གནས་པ་ཕྱོགས་དང་མི་འཐུན་པའི་མྱ་ངན་ལས་མ་འདས་ཤིང་འཕགས་པས་དམོད་གོར་མ་ཆག །
en: Renouncers of misdeeds, the physical austerities, observances, and religious lifestyles you maintain do not lead to nirvāṇa because they contradict it and are most certainly condemned by the noble ones!”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “Respected Blessed One, it is so.”

source: སྡིག་པ་སྤོང་བ་ཁྱོད་ཐར་པ་ལ་ཡང་ཕྱོགས་དང་མི་འཐུན་པའི་མྱ་ངན་ལས་འདས་པས་འཕགས་པ་ལ་དམོད་པ་ནི་འདི་ལྟ་སྟེ།
en: The Blessed One continued, “Renouncers of misdeeds, you are condemned by the noble ones because nirvāṇa stands in opposition to your liberation.

source: དྲི་མས་དྲི་མ་བཀྲུས་པ་དང་། དམར་པོས་དམར་པོ་བཀྲུས་པ་དང་། མུན་པས་མུན་པ་ལ་ཞུགས་པ་དང་། དུག་གིས་དུག་ཟོས་པ་དང་།
en: Just as beings who try to clean dirt with filth, who try to remove red stains by applying red substances, who try to clear away darkness with obscurity, who try to cure poison by eating poison, and who throw themselves into fires when they are burned, you strive in that same way for the liberation that transcends suffering and misery.
